---
kind: property
id: P:Autodesk.Revit.DB.FillPattern.Name
source: html/b213b64f-ec78-9d70-4650-de5bb265c4ac.htm
---
# Autodesk.Revit.DB.FillPattern.Name Property

The name of the fill pattern.

## Syntax (C#)
```csharp
public string Name { get; set; }
```

## Remarks
The name of solid fill patterns cannot be changed.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null